ya_error_lib = {
    'BAD_PHOTO': 'В объявлении используются неинформативные фотографии',
    'DAMAGED_PHOTO': 'В объявлении используются маленькие фотографии или '
                     'фотографии низкого качества',
    'AD_ON_PHOTO': 'На фотографиях размещена рекламная информация',
    'AGENT_PHONE_NOT_SET': 'Телефон агента или продавца не указан или указан '
                           'в неправильном формате',
    'BAN_OFFERS_WITHOUT_CADASTRAL_NUMBER': 'Пропущено обязательное поле',
    'BANNED_AGENCY': 'Объявления этого агентства имеют низкий '
                     'уровень достоверности',
    'CHECK_ALREADY_BOOKED': 'При проверке выяснилось, что объект находится '
                            'под залогом',
    'CHECK_INCORRECT_WATERMARK': 'В объявлении используются фотографии, '
                                 'на которых есть посторонние изображения',
    'CHECK_OFFER_IS_AD': 'Проверка модератором: объявление носит рекламный '
                         'характер',
    'CHECK_OFFER_SOLD_OUT': 'Проверка модератором: объект из '
                            'объявления продан',
    'CHECK_STOPWORD': 'В описании объявления или в имени автора '
                      'используются нецензурные выражения или реклама',
    'CHECK_UNAVAILABLE': 'До продавца невозможно дозвониться',
    'CHECK_UNKNOWN_OBJECT': 'Контактное лицо, указанное в объявлении, '
                            'не владеет информацией об объекте',
    'CHECK_UNKNOWN_REASON': 'Объявление заблокировано по жалобе пользователя',
    'CHECK_WRONG_ADDRESS': 'Проверка модератором: указан неверный '
                           'адрес объекта',
    'CHECK_WRONG_DATA': 'Проверка модератором: несоответствие параметров '
                        'в объявлении',
    'CHECK_WRONG_PHOTO': 'Объявление содержит фотографии низкого качества '
                         'или фотографии, не относящиеся к объекту',
    'CHECK_WRONG_PRICE': 'Проверка модератором: в объявлении указана '
                         'неверная цена',
    'CLONE': 'У вас уже есть такое объявление',
    'COORDINATES_NOT_FOUND': 'Географические координаты объекта '
                             'вычислены неправильно',
    'COMMERCIAL_IN_LIVING': 'Тип объекта не соответствует разделу сервиса',
    'COMPLAINT_FROM_OWNER': 'Информация о собственнике скрыта или '
                            'объявление размещено без согласия собственника',
    'CONTACT_IN_DESCRIPTION': 'Контакты в описании',
    'CREATION_DATE_NOT_SET': 'Дата создания объявления не указана или '
                             'указана в неподходящем формате',
    'HOTEL': 'Яндекс Недвижимость не размещает объявления об аренде '
             'номеров в гостиницах и хостелах.',
    'HOUSE_IN_APARTMENT': 'Тип объекта не соответствует разделу сервиса',
    'HOUSE_IN_LOT': 'Тип объекта не соответствует разделу сервиса',
    'ILLEGAL_SELL_FOR_LEGAL_ADDRESS': 'В объявлении о продаже '
                                      'коммерческого объекта указана '
                                      'категория «legal address» '
                                      '(юридический адрес)',
    'INACTIVE_CAMPAIGN': 'Рекламная кампания неактивна',
    'INTERNAL_ID_NOT_SET': 'Не указан идентификатор объявления',
    'INVALID_COMMERCIAL_TYPES': 'Не указана категория коммерческого объекта',
    'INVALID_COMMISSION': 'Неправильно указан размер комиссии',
    'INVALID_ELECTRIC_CAPACITY': 'Неправильно указана выделенная '
                                 'электрическая мощность',
    'INVALID_FULL_OPTION_SALE': 'Нельзя размещать переуступку на '
                                'минимальном тарифе',
    'INVALID_GARAGE_TYPE': 'Не указан тип гаража',
    'INVALID_PALLET_PRICE': 'Неправильно указана стоимость палето-места',
    'INVALID_PARKING_GUEST_PLACES': 'Неправильно указано количество '
                                    'гостевых парковочных мест',
    'INVALID_PARKING_PLACE_PRICE': 'Неправильно указана стоимость '
                                   'парковочного места',
    'INVALID_PARKING_PLACES': 'Неправильно указано количество '
                              'предоставляемых парковочных мест',
    'INVALID_PHONE_LINES': 'Неправильно указано количество телефонных линий',
    'INVALID_PRICE': 'Недостоверная цена',
    'INVALID_PRIMARY_SALE': 'Объявления «от застройщика» могут быть '
                            'размещены только авторизованными партнерами',
    'INVALID_SECURITY_PAYMENT': 'Неправильно указан размер '
                                'обеспечительного платежа',
    'INVALID_USE_OF_OPEN_PLAN': 'Значение «свободная планировка» '
                                'используется только для объявлений о '
                                'продаже квартир и коммерческой недвижимости',
    'INVALID_USE_OF_STUDIO': 'Значение «студия» используется только '
                             'для объявлений о продаже квартир',
    'LIVING_SPACE_IS_TOO_HIGH': 'Неправильно указана жилая площадь',
    'LOCATION_NOT_FOUND': 'Неизвестно местоположение объекта',
    'LOT_AREA_NOT_SET': 'Не указана площадь участка',
    'LOT_HAS_AREA_AND_LOT_AREA': 'В объявлении о продаже участка без '
                                 'дома площадь участка передана в теге area',
    'LOT_RENT': 'Яндекс Недвижимость не размещает объявления об '
                'аренде участков',
    'LOW_ACTUALITY': 'Объявление не соответствуют требованиям '
                     'Яндекс Недвижимости',
    'NEW_IN_OLD': 'Тип объекта не соответствует разделу сервиса',
    'NO_IMAGES': 'Отсутствуют фотографии объекта.',
    'NO_INFO': 'Объект закрыт для просмотра или не существует',
    'NO_PLACEMENT': 'Необходимо оплатить размещение объявлений',
    'NO_PLAN_PHOTO': 'В объявлении о продаже квартиры в новостройке '
                     'нет изображения планировки',
    'NO_ROOMS_IN_APARTMENT': 'Не указано количество комнат в квартире',
    'NO_ROOMS_OFFERED_FOR_ROOMS': 'В объявлении о продаже или аренде комнат '
                                  'не указано количество комнат, участвующих '
                                  'в сделке, и общее количество комнат',
    'NO_SHOW': 'Объект закрыт для просмотра',
    'NOT_REALTY': 'Объявление содержит информацию о продаже товаров или услуг',
    'OFFER_TOO_OLD': 'Слишком старое объявление',
    'OLD_PHOTO': 'В объявлении используются старые фотографии',
    'PARTIALLY_ADDRESS': 'Неполный адрес или неточная метка на карте.',
    'PEOPLE_ON_PHOTO': 'На снимках есть люди или посторонние предметы',
    'PHONE_NOT_EXIST': 'Указан неверный или недействительный телефон',
    'PHONE_UNAVAILABLE': 'Указан неверный или недействительный телефон',
    'PHOTO_STEAL': 'Недостоверные или чужие фотографии',
    'REGISTRATION': 'Объявление содержит информацию об услугах',
    'RENT_IN_SELL': 'Тип сделки не соответствует разделу сервиса',
    'PRICE_ERROR': 'Недостоверная цена',
    'PRICE_NOT_SET': 'Не указана цена объекта',
    'PRICE_PERIOD_NOT_SET_FOR_RENT': 'Срок аренды указан в неподходящем '
                                     'формате',
    'PRICE_PERIOD_SET_FOR_SELL': 'В объявлении о продаже объекта указан '
                                 'период для расчета стоимости аренды',
    'PRICE_PERIOD_UNKNOWN': 'Неправильно указан период для расчета '
                            'стоимости аренды',
    'PRICE_UNIT_UNKNOWN': 'Неизвестная единица измерения площади',
    'ROOM_IN_APARTMENT': 'Тип объекта не соответствует разделу сервиса',
    'ROOMS_OFFERED_GREATER_OR_EQUAL_THAN_ROOMS': 'Количество комнат в '
                                                 'квартире, предлагаемых для '
                                                 'аренды или покупки, '
                                                 'превышает общее количество '
                                                 'комнат в квартире',
    'ROOMS_SPACE_NOT_MATCH_ROOMS_COUNT': 'Количество переданных значений '
                                         'площади комнат не '
                                         'соответствует количеству комнат',
    'SERVICE_SUGGEST': 'В объявлении предлагаются услуги или другие объекты',
    'SITE_OFFER_BASE_FIELD_NOT_SET': 'Отсутствуют поля, обязательные '
                                     'для новостроек',
    'STRANGE_DISTANCE_FOR_MANUAL_POINT': 'Указанные координаты '
                                         'не соответствуют действительности',
    'SUSPICIOUS_OFFER_AGE': 'Объявление не соответствует требованиям '
                            'к срокам размещения',
    'TEXT_IN_PHOTO': 'В объявлении используются фотографии, на которых '
                     'есть посторонние изображения',
    'TOO_BIG_LOT_AREA': 'Объекты площадью более 1 гектара считаются '
                        'участками коммерческого назначения',
    'UNKNOWN_CATEGORY': 'Неправильно указаны категория объекта или '
                        'тип продавца (арендодателя)',
    'UNKNOWN_LOCATION_TYPE': 'Недостаточно информации для определения '
                             'точного местоположения объекта',
    'UNKNOWN_NEWBUILDING': 'Объявление об объекте в неизвестной новостройке',
    'UNKNOWN_TYPE': 'Неправильно указан тип сделки',
    'URL_NOT_SET': 'Не указана ссылка на объявление',
    'VILLAGE_NON_TARGET_SALE': 'В этом посёлке нельзя размещать вторичку',
    'WRONG_AREA': 'Неверно указана площадь объекта',
    'WRONG_CADASTRAL': 'Неверный или недействительный кадастровый номер',
    'WRONG_CATEGORY': 'Ошибка в типе объявления',
    'WRONG_FLOOR': 'Неверно указан этаж или количество этажей в здании',
    'WRONG_LOT_AREA': 'Неверно указана площадь участка',
    'WRONG_NAME': 'Имя продавца указано некорректно.',
    'WRONG_PIN': 'Неполный адрес или неточная метка на карте.',
    'WRONG_PRICE_PERIOD': 'Цена не соответствует периоду аренды',
    'WRONG_ROOMS': 'Неверно указано число комнат',
}
